**Step-1: Import the packages**

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a DataFrame using List**

In [6]:
names=['sampath','vijay','chinna','pawan']
pd.DataFrame(names)

         0
0  sampath
1    vijay
2   chinna
3    pawan

**Step-2.1:Creating DataFrame using Two lists or more**

In [11]:
names=['sampath','vijay','chinna','pawan']
age=[22,23,24,24]
pd.DataFrame(zip(names,age)) # we have to use zip if we are using more than one list

         0   1
0  sampath  22
1    vijay  23
2   chinna  24
3    pawan  24

In [17]:
##  DataFrame with 3 lists
names=['Sampath','Vijay','Chinna','Pawan']
age=[22,23,24,24]
city=['Banglore','Pune','Hyderbad','Hyderabad']
pd.DataFrame(zip(names,age,city)) # if we not given enough values to the corresponding list then it will take only given values and skip the other value
                                  # and not displays in the output

         0   1          2
0  Sampath  22   Banglore
1    Vijay  23       Pune
2   Chinna  24   Hyderbad
3    Pawan  24  Hyderabad

**Step-3: Inserting Columns**

- column value expect an index or array-like

In [28]:
names=['Sampath','Vijay','Chinna','Pawan']
pd.DataFrame(names,columns=['Names']) # columns attribute excpects index or array like input

     Names
0  Sampath
1    Vijay
2   Chinna
3    Pawan

In [30]:
# for 3 lists
names=['Sampath','Vijay','Chinna','Pawan']
age=[22,23,24,24]
city=['Banglore','Pune','Hyderbad','Hyderabad']
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

     Names  Age       City
0  Sampath   22   Banglore
1    Vijay   23       Pune
2   Chinna   24   Hyderbad
3    Pawan   24  Hyderabad

In [32]:
# using variable for columns
names=['Sampath','Vijay','Chinna','Pawan']
age=[22,23,24,24]
city=['Banglore','Pune','Hyderbad','Hyderabad']
cols=['Names','Age','City']
pd.DataFrame(zip(names,age,city),columns=cols)

     Names  Age       City
0  Sampath   22   Banglore
1    Vijay   23       Pune
2   Chinna   24   Hyderbad
3    Pawan   24  Hyderabad

**Step-4: Modify the index**

In [41]:
names=['Sampath','Vijay','Chinna','Pawan']
age=[22,23,24,24]
city=['Banglore','Pune','Hyderbad','Hyderabad']
cols=['Names','Age','City']
index=['A','B','C','D']
df1=pd.DataFrame(zip(names,age,city),
                 columns=cols,
                 index=index)

In [43]:
df1

     Names  Age       City
A  Sampath   22   Banglore
B    Vijay   23       Pune
C   Chinna   24   Hyderbad
D    Pawan   24  Hyderabad

In [45]:
type(df1)

pandas.core.frame.DataFrame

**Step-5:Create a DataFrame using Dictionary**

In [52]:
dic={
    'Names':['Sampath','Omkar','Vijay','Ajay'],
    'Age':[22,37,23,22],
    'City':['Banglore','Hyd','Hyd','Pune']
}
pd.DataFrame(dic) #keys acts as column hedings and values acts as column values

     Names  Age      City
0  Sampath   22  Banglore
1    Omkar   37       Hyd
2    Vijay   23       Hyd
3     Ajay   22      Pune

**Step-6: Creating DataFrame using Scalar values means without using list in dictionary**

In [48]:
phonebook={
    'sampath':8522968806,
    'vijay':876490217,
    'ajay':9618446711,
    'pawan':6305660949,
}
pd.DataFrame(phonebook)

ValueError: If using all scalar values, you must pass an index

In [248]:
phonebook={
    'sampath':8522968806,
    'vijay':876490217,
    'ajay':9618446711,
    'pawan':6305660949,
}
index=[1]
pd.DataFrame(phonebook,index=index) # index must be given for scalar type values

      sampath      vijay        ajay       pawan
1  8522968806  876490217  9618446711  6305660949

**Step-7: Data quick checks**

- shape
- size
- len
- columns
- dtypes

In [65]:
df1

     Names  Age       City
A  Sampath   22   Banglore
B    Vijay   23       Pune
C   Chinna   24   Hyderbad
D    Pawan   24  Hyderabad

In [75]:
df1.shape # 4 rows 3 columns

(4, 3)

In [73]:
df1.size # total 12 elements are present in the DF

12

In [83]:
df1.dtypes

Names    object
Age       int64
City     object
dtype: object

In [85]:
len(df1)

4

**Step-8: Add data to empty dataframe**

In [96]:
empty_df=pd.DataFrame()
empty_df['Names']=['Sampath','Vijay']
empty_df['Age']=[22,23]
empty_df.index=['a','b']
empty_df

     Names  Age
a  Sampath   22
b    Vijay   23

**Step-9: Add data to already existing DataFrame**

- df1 already has a data withh columns Names,Age,City

- Now we want to create a new column with Marks

In [104]:
df1

     Names  Age       City
A  Sampath   22   Banglore
B    Vijay   23       Pune
C   Chinna   24   Hyderbad
D    Pawan   24  Hyderabad

In [106]:
df1['Marks']=[95,89,65,88]
df1

     Names  Age       City  Marks
A  Sampath   22   Banglore     95
B    Vijay   23       Pune     89
C   Chinna   24   Hyderbad     65
D    Pawan   24  Hyderabad     88

**Step-10: How to update the column Values**

- if you want to add the new column to empty dataframe

- if yoy want to add the new column to existing dataframe

- if you want to modify the data of specific column

- syntax is same

- df[col_name]=[data]

In [112]:
df1.columns

Index(['Names', 'Age', 'City', 'Marks'], dtype='object')

In [114]:
df1

     Names  Age       City  Marks
A  Sampath   22   Banglore     95
B    Vijay   23       Pune     89
C   Chinna   24   Hyderbad     65
D    Pawan   24  Hyderabad     88

In [118]:
df1['City']=['Banglore','Banglore','Pune','Hyd']
df1

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [120]:
df1['city']=['Banglore','Banglore','Pune','Blr'] # new column added instead of modifying 
                                                 # Dataframe is Case Sensitive

In [122]:
df1

     Names  Age      City  Marks      city
A  Sampath   22  Banglore     95  Banglore
B    Vijay   23  Banglore     89  Banglore
C   Chinna   24      Pune     65      Pune
D    Pawan   24       Hyd     88       Blr

**Step-11: How to drop Specific Column**

- by default axix=0 represents index

- if you want to drop the column change axis=1

- inplace=True then DataFrame will overwrite

In [126]:
df1.drop('city',
        axis=1,
        inplace=True)

In [128]:
df1

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [142]:
df1['age']=[20,20,20,20]
df1

     Names  Age      City  Marks  age
A  Sampath   22  Banglore     95   20
B    Vijay   23  Banglore     89   20
C   Chinna   24      Pune     65   20
D    Pawan   24       Hyd     88   20

In [136]:
df1.drop('age')  # by default it will take index to drop
                 # since index has no element "age" it raises error

KeyError: "['age'] not found in axis"

In [ ]:
df1.drop(columns='age') # not using inlace=True

In [134]:
df1 # changes not happened cuz we not overwritten with inplace=True

     Names  Age      City  Marks  age
A  Sampath   22  Banglore     95   20
B    Vijay   23  Banglore     89   20
C   Chinna   24      Pune     65   20
D    Pawan   24       Hyd     88   20

In [144]:
df1.drop(columns='age',inplace=True)
df1 # changes succesfully done

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

**Dropping Multiple columns**

In [148]:
df1['age']=[20,20,20,22]
df1['job']=['x','y','z','x']
df1

     Names  Age      City  Marks  age job
A  Sampath   22  Banglore     95   20   x
B    Vijay   23  Banglore     89   20   y
C   Chinna   24      Pune     65   20   z
D    Pawan   24       Hyd     88   22   x

In [151]:
df1.drop(columns=['age','job']) # not used inplace=True

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [153]:
df1 # not overwritten

     Names  Age      City  Marks  age job
A  Sampath   22  Banglore     95   20   x
B    Vijay   23  Banglore     89   20   y
C   Chinna   24      Pune     65   20   z
D    Pawan   24       Hyd     88   22   x

In [155]:
df1.drop(columns=['age','job'],inplace=True)

In [159]:
df1 # successfully overwritten

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

**Step-12:How to drop a specific Row**

- labels

In [164]:
df1

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [170]:
df1.drop(['C']) # by default axis=0 so index will be deleted

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
D    Pawan   24       Hyd     88

In [172]:
df1.drop(labels=['C']) # labels are used to delete index

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
D    Pawan   24       Hyd     88

In [176]:
df1 # we not overwritten because its just for understanding

     Names  Age      City  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

**Step-13: Rename the column**

- create a dictionary key as old name value as new name

In [182]:
dict1={'Marks':'marks'}
df1.rename(dict1,axis=1) # we will pass dictionary for this function
                         # not used inplace=True

     Names  Age      City  marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [186]:
df1.rename(columns=dict1) # using columns attribite

     Names  Age      City  marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

**Changing all columns**

In [197]:
col_names={
    'Names':'names',
    'Age':'age',
    'City':'location',
    'Marks':'obtained_marks',
}
df1.rename(columns=col_names)

     names  age  location  obtained_marks
A  Sampath   22  Banglore              95
B    Vijay   23  Banglore              89
C   Chinna   24      Pune              65
D    Pawan   24       Hyd              88

**Simple method**

In [204]:
df1.columns=['peru','vayasu','prantham','markulu']
df1

      peru  vayasu  prantham  markulu
A  Sampath      22  Banglore       95
B    Vijay      23  Banglore       89
C   Chinna      24      Pune       65
D    Pawan      24       Hyd       88

In [206]:
df1 # automatically overwritten

      peru  vayasu  prantham  markulu
A  Sampath      22  Banglore       95
B    Vijay      23  Banglore       89
C   Chinna      24      Pune       65
D    Pawan      24       Hyd       88

**Step-14:Add a new row**

In [216]:
df1.columns=['Names','Age','Location','Marks'] # chanf=ging back to normal

In [218]:
df1

     Names  Age  Location  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88

In [ ]:
df1[<col_name]=[v1,v2,v3]
df1.loc[<index]=[data]

In [220]:
df1.loc['E']=['Ajay',22,'Hyd',87]
df1

     Names  Age  Location  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88
E     Ajay   22       Hyd     87

**Step-15: Save the DataFrame**

In [223]:
df1

     Names  Age  Location  Marks
A  Sampath   22  Banglore     95
B    Vijay   23  Banglore     89
C   Chinna   24      Pune     65
D    Pawan   24       Hyd     88
E     Ajay   22       Hyd     87

In [225]:
df1.to_csv('S1_Basic_revision_EDA.csv')

**Step-16:Read the saved Dataframe**

In [230]:
pd.read_csv('S1_Basic_revision_EDA.csv') # again index is created

  Unnamed: 0    Names  Age  Location  Marks
0          A  Sampath   22  Banglore     95
1          B    Vijay   23  Banglore     89
2          C   Chinna   24      Pune     65
3          D    Pawan   24       Hyd     88
4          E     Ajay   22       Hyd     87

In [232]:
df1.to_csv('Basic_operations_revision_EDA.csv',index=False)

In [236]:
pd.read_csv('Basic_operations_revision_EDA.csv') # readed succesfully

     Names  Age  Location  Marks
0  Sampath   22  Banglore     95
1    Vijay   23  Banglore     89
2   Chinna   24      Pune     65
3    Pawan   24       Hyd     88
4     Ajay   22       Hyd     87

In [244]:
df1.to_excel('basic operations.xlsx',index=False) # converting to excel file

In [242]:
pd.read_excel("basic operations.xlsx") # successfully readed

     Names  Age  Location  Marks
0  Sampath   22  Banglore     95
1    Vijay   23  Banglore     89
2   Chinna   24      Pune     65
3    Pawan   24       Hyd     88
4     Ajay   22       Hyd     87